---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.ApparentPower
source: html/6b936dab-2a5c-51cd-01a1-5db501964e63.htm
---
# Autodesk.Revit.DB.SpecTypeId.ApparentPower Property

Apparent Power, in discipline Electrical.

## Syntax (C#)
```csharp
public static ForgeTypeId ApparentPower { get; }
```